<a href="https://colab.research.google.com/github/robcarv/Data_science_alura/blob/master/Pandas_IO.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [22]:
##Criando os nomes

# Criando os nomes

In [2]:
import pandas as pd

In [7]:
nomes_m = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=m')
nomes_f = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=f')

In [8]:
nomes_m

          nome  regiao     freq  rank sexo
0         JOSE       0  5732508     1    M
1         JOAO       0  2971935     2    M
2      ANTONIO       0  2567494     3    M
3    FRANCISCO       0  1765197     4    M
4       CARLOS       0  1483121     5    M
..         ...     ...      ...   ...  ...
195     WALTER       0    67207   196    M
196    ARLINDO       0    66669   197    M
197    MICHAEL       0    65736   198    M
198     ALVARO       0    65444   199    M
199    GEOVANE       0    65435   200    M

[200 rows x 5 columns]

In [15]:
print("Quantidade de nomes: " + str(len(nomes_f) + len(nomes_m)))

Quantidade de nomes: 400

In [16]:
frames = [nomes_f,nomes_m]

In [17]:
pd.concat(frames)['nome'].to_frame()

          nome
0        MARIA
1          ANA
2    FRANCISCA
3      ANTONIA
4      ADRIANA
..         ...
195     WALTER
196    ARLINDO
197    MICHAEL
198     ALVARO
199    GEOVANE

[400 rows x 1 columns]

In [18]:
nomes= pd.concat(frames)['nome'].to_frame()

In [21]:
nomes.sample(400)

          nome
116    MARCELA
162     ISMAEL
3      ANTONIA
116   DOMINGOS
53      ELAINE
..         ...
28       SONIA
109    GEOVANA
81        LUAN
37   ROSANGELA
98      GILSON

[400 rows x 1 columns]

# Incluindo ID alunos

In [23]:
import numpy as np
np.random.seed(123)

In [24]:
total_alunos = len(nomes)
total_alunos

400

In [26]:
nomes['id_aluno'] =np.random

In [27]:
nomes

          nome  ...                                           id_aluno
0        MARIA  ...  <module 'numpy.random' from '/usr/local/lib/py...
1          ANA  ...  <module 'numpy.random' from '/usr/local/lib/py...
2    FRANCISCA  ...  <module 'numpy.random' from '/usr/local/lib/py...
3      ANTONIA  ...  <module 'numpy.random' from '/usr/local/lib/py...
4      ADRIANA  ...  <module 'numpy.random' from '/usr/local/lib/py...
..         ...  ...                                                ...
195     WALTER  ...  <module 'numpy.random' from '/usr/local/lib/py...
196    ARLINDO  ...  <module 'numpy.random' from '/usr/local/lib/py...
197    MICHAEL  ...  <module 'numpy.random' from '/usr/local/lib/py...
198     ALVARO  ...  <module 'numpy.random' from '/usr/local/lib/py...
199    GEOVANE  ...  <module 'numpy.random' from '/usr/local/lib/py...

[400 rows x 3 columns]

In [28]:
nomes.pop('id_alluno')

0      <module 'numpy.random' from '/usr/local/lib/py...
1      <module 'numpy.random' from '/usr/local/lib/py...
2      <module 'numpy.random' from '/usr/local/lib/py...
3      <module 'numpy.random' from '/usr/local/lib/py...
4      <module 'numpy.random' from '/usr/local/lib/py...
                             ...
195    <module 'numpy.random' from '/usr/local/lib/py...
196    <module 'numpy.random' from '/usr/local/lib/py...
197    <module 'numpy.random' from '/usr/local/lib/py...
198    <module 'numpy.random' from '/usr/local/lib/py...
199    <module 'numpy.random' from '/usr/local/lib/py...
Name: id_alluno, Length: 400, dtype: object

In [29]:
nomes

          nome                                           id_aluno
0        MARIA  <module 'numpy.random' from '/usr/local/lib/py...
1          ANA  <module 'numpy.random' from '/usr/local/lib/py...
2    FRANCISCA  <module 'numpy.random' from '/usr/local/lib/py...
3      ANTONIA  <module 'numpy.random' from '/usr/local/lib/py...
4      ADRIANA  <module 'numpy.random' from '/usr/local/lib/py...
..         ...                                                ...
195     WALTER  <module 'numpy.random' from '/usr/local/lib/py...
196    ARLINDO  <module 'numpy.random' from '/usr/local/lib/py...
197    MICHAEL  <module 'numpy.random' from '/usr/local/lib/py...
198     ALVARO  <module 'numpy.random' from '/usr/local/lib/py...
199    GEOVANE  <module 'numpy.random' from '/usr/local/lib/py...

[400 rows x 2 columns]

In [30]:
nomes.sample(4)

          nome                                           id_aluno
34   SEBASTIAO  <module 'numpy.random' from '/usr/local/lib/py...
42     MARLENE  <module 'numpy.random' from '/usr/local/lib/py...
103     MAICON  <module 'numpy.random' from '/usr/local/lib/py...
155    CECILIA  <module 'numpy.random' from '/usr/local/lib/py...

In [31]:
nomes['id_aluno'] = np.random.permutation(total_alunos) +1

In [32]:
nomes

          nome  id_aluno
0        MARIA       189
1          ANA        58
2    FRANCISCA       204
3      ANTONIA       383
4      ADRIANA       231
..         ...       ...
195     WALTER         9
196    ARLINDO       378
197    MICHAEL        50
198     ALVARO       244
199    GEOVANE       387

[400 rows x 2 columns]

In [33]:
dominios = ['@dominiodoemmail.com.br', '@servicodoemail.com']

In [34]:
dominios

['@dominiodoemmail.com.br', '@servicodoemail.com']

In [35]:
nomes ['dominio'] = np.random.choice(dominios,total_alunos)

In [36]:
nomes

          nome  id_aluno                  dominio
0        MARIA       189  @dominiodoemmail.com.br
1          ANA        58      @servicodoemail.com
2    FRANCISCA       204      @servicodoemail.com
3      ANTONIA       383  @dominiodoemmail.com.br
4      ADRIANA       231      @servicodoemail.com
..         ...       ...                      ...
195     WALTER         9  @dominiodoemmail.com.br
196    ARLINDO       378      @servicodoemail.com
197    MICHAEL        50  @dominiodoemmail.com.br
198     ALVARO       244  @dominiodoemmail.com.br
199    GEOVANE       387      @servicodoemail.com

[400 rows x 3 columns]

In [37]:
nomes['email'] = nomes.nome.str.cat(nomes.dominio).str.lower()
nomes

          nome  ...                           email
0        MARIA  ...    maria@dominiodoemmail.com.br
1          ANA  ...          ana@servicodoemail.com
2    FRANCISCA  ...    francisca@servicodoemail.com
3      ANTONIA  ...  antonia@dominiodoemmail.com.br
4      ADRIANA  ...      adriana@servicodoemail.com
..         ...  ...                             ...
195     WALTER  ...   walter@dominiodoemmail.com.br
196    ARLINDO  ...      arlindo@servicodoemail.com
197    MICHAEL  ...  michael@dominiodoemmail.com.br
198     ALVARO  ...   alvaro@dominiodoemmail.com.br
199    GEOVANE  ...      geovane@servicodoemail.com

[400 rows x 4 columns]

In [38]:
nomes.head(10)

        nome  id_aluno                  dominio                           email
0      MARIA       189  @dominiodoemmail.com.br    maria@dominiodoemmail.com.br
1        ANA        58      @servicodoemail.com          ana@servicodoemail.com
2  FRANCISCA       204      @servicodoemail.com    francisca@servicodoemail.com
3    ANTONIA       383  @dominiodoemmail.com.br  antonia@dominiodoemmail.com.br
4    ADRIANA       231      @servicodoemail.com      adriana@servicodoemail.com
5    JULIANA       285      @servicodoemail.com      juliana@servicodoemail.com
6     MARCIA       105  @dominiodoemmail.com.br   marcia@dominiodoemmail.com.br
7   FERNANDA       237      @servicodoemail.com     fernanda@servicodoemail.com
8   PATRICIA         5      @servicodoemail.com     patricia@servicodoemail.com
9      ALINE       268  @dominiodoemmail.com.br    aline@dominiodoemmail.com.br

<!-- ##Para criar os nomes das pessoas, usamos o comando read_json() para ler os nomes femininos e masculino. Armazenamos o resultado de cada um deles em uma variÃ¡vel chamada nomes_f para os nomes femininos e nomes_m para os nomes masculinos.

PorÃ©m, nÃ£o queremos trabalhar com um DataFrame para os nomes masculinos e outro DataFrame para os nomes femininos.

Sabendo disso, analise as alternativas abaixo e marque aquela que contÃ©m o cÃ³digo que irÃ¡ juntar os nomes em um Ãºnico DataFrame: **bold text** -->